@extends('layouts.wamy.wamy')
@section('css')
@endsection
@section('title')
    <title>لائحة صندوق الإدخار - الندوة العالمية للشباب الإسلامي</title>
@endsection
@section('content')
<div class="mb-5"></div>
    <div class="row">
        <div class="col-lg-12">
            <div class="card">
                <div class="card-header">
                    <h3 class="card-title hedr-font">لائحة صندوق الإدخار</h3>
                </div>
                <div class="card-body">
                    @if ($errors->any())
                        @include('alert.errors')
                    @endif

                    <div class="row" id="slatemsg">
                        <div class="col-lg-12 col-md-12">
                            <div class="card slate">
                                <div class="card-header text-center">
                                    <h2>إجراءات التسجيل</h2>
                                </div>
                                <div class="card-body">
                                    <div class="wpage-one" id="wpage-one" style="font-size: 18px">
                                        <strong>
                                            1- الاطلاع على لائحة صندوق الادخار.
                                            <br><br>
                                            2- تعبئة بيانات استمارة الاشتراك بدقة.
                                            <br><br>
                                            3- التوقيع بالإقرار.
                                        </strong>

                                    </div>
                                </div>
                                <div class="card-footer text-center">
                                    <div>
                                        {{-- <a id="nextlink" href="" class="btn btn-primary">أوافق</a> --}}
                                        <button onclick="nextlink()" id="nextlink"class="btn btn-primary">أوافق</button>
                                    </div>
                                </div>
                            </div>
                        </div>
                    </div>
                    <div class="row" id="slateboard" style="display: none">
                        <div class="col-lg-12 col-md-12">
                            <div class="card slate">
                                <div class="card-header text-center">
                                    <h2>لائحة صندوق الادخار للعاملين في الندوة العالمية للشباب الإسلامي</h2>
                                </div>
                                <div class="card-body">
                                    <div class="wpage-one" id="wpage-one">
                                        <h5>المادة الأولى</h5>
                                        <p>
                                            ينشأ لموظفي الندوة العالمية للشباب الإسلامي صندوق ادخار يشار إليه في هذه اللائحة ((بالصندوق)).
                                            وذلك بناء على المادة (64) من لائحة شؤون الموظفين.
                                        </p>
                                        <h5>المادة الثانية</h5>
                                        <p>
                                            يهدف الصندوق إلى تحقيق المصلحة العامة للأعضاء المشتركين فيه من خلال دعم روح التعاون وتحقيق مبدأ
                                            التكافل الاجتماعي فيما بينهم عملاً بقوله تعالى ((وَتَعَاوَنُواْ عَلَى الْبرِّ وَالتَّقْوَى)).
                                        </p>
                                        <h5>المادة الثالثة</h5>
                                        <p>
                                            يحق لجميع العاملين في الأمانة العامة للندوة من موظفين ومتعاونين ممن لهم راتب شهري دوري من الندوة
                                            الاشتراك في الصندوق وفق الشروط الآتية:
                                            <br>
                                            1. أن يكون موظفاً في الندوة العالمية للشباب الإسلامي أثناء اشتراكه في الصندوق.
                                            <br>
                                            2. الاطلاع على لائحة الصندوق والموافقة على الالتزام بها.
                                            <br>
                                            3. الانتظام في سداد القسط الشهري.
                                            <br>
                                            4. أن يكون قد اجتاز الفترة التجريبية للعمل في الندوة.
                                            <br>
                                            5. تعبئة نموذج طلب الاشتراك وتسليمه إلى لجنة إدارة الصندوق.
                                        </p>
                                        <h5>المادة الرابعة</h5>
                                        <p>
                                            يكون للصندوق جمعية عمومية تتكون من جميع الأعضاء المشتركين، وتعد الجمعية العمومية أعلى سلطة
                                            إدارية وتنظيمية للصندوق ولها الصلاحيات الإشرافية والإدارية التي تخولها القيام بمهامها.
                                        </p>

                                        <h5>المادة الخامسة</h5>
                                        <p>
                                            تختار الجمعية العمومية رئيسًا لها من بين الأعضاء لمدة سنتين بموافقة الأمين العام، ومن مهامه
                                            الدعوة لانعقاد الجمعية العمومية في الحالات التي يقدرها، وتنظيم انعقادها وإدارة اجتماعاتها وطرح
                                            المواضيع للتصويت وإعلان النتائج.
                                        </p>
                                        <h5>المادة السادسة</h5>
                                        <p>
                                            تختص الجمعية العمومية للصندوق بما يأتي:
                                            <br>
                                            1. انتخاب أعضاء مجلس إدارة الصندوق وإبراء ذمة أعضاء المجلس السابقين.
                                            <br>
                                            2. اعتماد ميزانية السنة الماضية والحساب الختامي للصندوق.
                                            <br>
                                            3. المصادقة على تقرير مراجع الحسابات عن أعمال السنة الماضية.
                                            <br>
                                            4. إقرار الموازنة التقديرية للعام القادم.
                                            <br>
                                            5. تعيين مراجع حسابات خارجي.
                                            <br>
                                            6. اقتراح تعديل اللائحة ولا يُعد التعديل نافذًا إلا باعتماده من الأمين العام أو من ينيبه.
                                            <br>
                                            7. اقتراح حل الصندوق ورفع الاقتراح إلى الأمين العام لاعتماده.
                                        </p>
                                        <h5>المادة السابعة</h5>
                                        <p>
                                            تنعقد الجمعية العمومية مرة واحدة كل عام خلال مدة لا تزيد عن (30) ثلاثين يوما من انتهاء السنة
                                            المالية، ويجوز عقد اجتماع استثنائي بدعوة من رئيس الجمعية العمومية أو بطلب خطي من ثلث أعضائها
                                            موضحاً فيه موضوعات الاجتماع، مع مراعاة ما يأتي:
                                            <br>
                                            1. يكون اجتماع الجمعية العمومية صحيحاً بحضور أغلبية الأعضاء (النصف + واحد).
                                            <br>
                                            2. في حالة عدم تحقق النصاب النظامي يحدد موعد بديل بعد أسبوعين على الأقل من تاريخ الاجتماع الأول،
                                            ولا يشترط لاجتماع الموعد البديل حضور الأغلبية.
                                            <br>
                                            3. تصدر كل قرارات الجمعية العمومية بموافقة الأغلبية، وعند تعادل الأصوات يرجح رئيس الجمعية نتيجة
                                            التصويت.
                                        </p>
                                        <h5>المادة الثامنة</h5>
                                        <p>
                                            يُرشِح الراغبون في عضوية مجلس إدارة الصندوق من أعضاء الجمعية العمومية أنفسهم حسب النموذج
                                            المعتمد، وتنتخب الجمعية أعضاء مجلس إدارة الصندوق بطريقة الانتخاب السري أثناء انعقاد اجتماع
                                            الجمعية العمومية، ومدة عمل مجلس إدارة الصندوق سنتان، وإذا لم تجتمع الجمعية العمومية في موعدها
                                            المحدد في المادة السابعة من هذه اللائحة، يستمر عمل مجلس إدارة الصندوق حتى تجتمع الجمعية العمومية
                                            وتنتخب مجلسًا جديدًا.
                                        </p>
                                        <h5>المادة التاسعة</h5>
                                        <p>
                                            يتكون مجلس إدارة الصندوق من: رئيس، ونائب للرئيس، وثلاثة أعضاء من المشتركين، ويختار المجلس من بين
                                            الأعضاء مقرراً للمجلس
                                        </p>
                                        <h5>المادة العاشرة</h5>
                                        <p>
                                            تصرف في السنة الأولى مكافأة مالية شهرية قدرها (200) مئتا ريال لكل من رئيس مجلس إدارة الصندوق
                                            ونائبه والأعضاء، وتصبح (300) ثلاثمئة ريال ابتداء من السنة الثانية، كما تصرف مكافأة قدرها (700)
                                            سبعمئة ريال لمحاسب الصندوق.
                                        </p>
                                        <h5>المادة الحادية عشرة</h5>
                                        <p>
                                            يتولى مجلس إدارة الصندوق جميع مهام الصندوق بما يكفل تحقيق الأهداف التي أنشئ من أجلها، وله على
                                            وجه الخصوص القيام بالمهام الآتية:
                                            <br>
                                            1. إصدار القرارات اللازمة لإدارة الصندوق وتنظيم سير العمل فيه والإشراف على حساباته.
                                            <br>
                                            2. تحصيل اشتراكات الأعضاء وإيرادات الصندوق وصرفها حسب الإجراءات المتبعة.
                                            <br>
                                            3. إعداد الموازنة السنوية للصندوق وعرض الحساب الختامي الذي يعده المراجع الخارجي مع التقرير
                                            المالي السنوي على الجمعية العمومية.
                                            <br>
                                            4. تقديم تقرير سنوي للجمعية العمومية عن أعمال الصندوق.
                                            <br>
                                            5. استثمار بعض إيرادات الصندوق بما يحقق النفع للأعضاء وفق الضوابط المنصوص عليها في المادة
                                            الثالثة عشرة.

                                        </p>
                                        <h5>المادة الثانية عشرة</h5>
                                        <p>
                                            تتكون موارد الصندوق مما يأتي:
                                            <br>
                                            1. اشتراكات الموظفين المشتركين في الصندوق على أن لا تقل قيمة الاشتراك عن (5%) من راتبه الإجمالي
                                            الشهري ولا تزيد عن (50%).
                                            <br>
                                            2. اشتراك الندوة كأحد الأعضاء في الصندوق بمبلغ (300.000) ثلاثمائة ألف ريال لمدة سنتين.
                                            <br>
                                            3. عائد المرابحة والاستثمار السنوي.
                                            <br>
                                            4. مساهمات الأعضاء المشتركين بالصندوق بمبالغ إضافية تضاف إلى أرصدتهم في الصندوق.
                                        </p>
                                        <h5>المادة الثالثة عشرة</h5>
                                        <p>
                                            توجه جلّ موارد الصندوق لبرنامج المرابحة للمشتركين، على أن يخصص جزء منها للاستثمار، مع مراعاة
                                            تخصيص 15% من إجمالي الإيرادات لتكوين احتياطي للصندوق.
                                        </p>
                                        <h5>المادة الرابعة عشرة</h5>
                                        <p>
                                            يستثمر الصندوق بعض أمواله حسب المادة الثالثة عشرة وفق الضوابط الآتية:
                                            <br>
                                            1. أن يتم الاستثمار مع شركات مرخص لها بمزاولة النشاط الذي يرغب الاستثمار معها فيه.
                                            <br>
                                            2. أن يكون لدى الشركة الملاءة المالية الكافية للقيام بالاستثمار.
                                            <br>
                                            3. توثيق عقد الاستثمار عن طريق أحد المحامين وتحديد حقوق وواجبات كل طرف وآليات التخارج وفض
                                            النزاع.
                                            <br>
                                            4. أن يكون لدى الشركة الخبرة الكافية والتجارب الناجحة في الاستثمار المطلوب المشاركة فيه.
                                            <br>
                                            5. أن يكون لدى الشركة ميزانيات سنوية معتمدة من مكتب محاسب قانوني معتمد.
                                            <br>
                                            6. أخذ الاحتياطات والضمانات اللازمة شرعياً ونظامياً.
                                            <br>
                                            7. أن يسجل الاستثمار باسم الصندوق أو باسم الندوة مباشرة.
                                            <br>
                                            8. أن يكون لدى الشركة دراسة جدوى للمشروع المراد الاستثمار فيه.
                                            <br>
                                            9. أن يكون الاستثمار قليل المخاطر وقصير الأجل.
                                            <br>
                                            10. زيارة مقر الشركة والوقوف على المشروع المراد الاستثمار فيه.
                                        </p>
                                        <h5>المادة الخامسة عشرة</h5>
                                        <p>
                                            يكون للصندوق برنامج مالي حاسوبي وسجلات خاصة منفصلة عن حسابات الندوة وسجلاتها، ولمجلس إدارة
                                            الصندوق أن يستعين بجهة الاختصاص في الندوة في تحصيل الاشتراكات وأقساط القروض وغيرها، وللمجلس
                                            اختيار أحد المحاسبين من منسوبي الإدارة المالية لتولي أعمال الصندوق المحاسبية بالتنسيق مع الإدارة
                                            المالية.
                                        </p>
                                        <h5>المادة السادسة عشرة</h5>
                                        <p>
                                            يُخصص حساب بنكي لإيداع المبالغ الخاصة بالصندوق في أحد حسابات الندوة الفرعية على أن يتم الصرف من
                                            الحساب الرئيس حسب النظام المتبع في الندوة.
                                        </p>
                                        <h5>المادة السابعة عشرة</h5>
                                        <p>
                                            يفتح مجلس إدارة الصندوق في سجلاته المحاسبية حساباً مستقلاً لكل مشترك في الصندوق يسجل فيه ما
                                            يأتي:
                                            <br>
                                            1. الاشتراكات أو المساهمات المحصلة منه.
                                            <br>
                                            2. حصته من أرباح الاستثمارات.
                                        </p>
                                        <h5>المادة الثامنة عشرة </h5>
                                        <p>
                                            يؤمن الصندوق للمشتركين السلع والخدمات مثل السيارات والأجهزة والأثاث وغيرها بنظام المرابحة الشرعي
                                            حسب المادة الثالثة عشرة، وفق الضوابط الآتية:
                                            <br>
                                            1. تعبئة نموذج طلب الشراء والإقرار بدفع الأقساط المترتبة.
                                            <br>
                                            2. أن تكون مستحقات نهاية الخدمة ورصيد المشترك تعادل كامل المبلغ، وفي حال تعذر ذلك يشترط وجود
                                            كفيل غارم نهاية خدمته ورصيده يغطي كامل الالتزام.
                                            <br>
                                            3. تسديد الرسوم الإدارية التي يحددها مجلس الإدارة.

                                        </p>
                                        <h5>المادة التاسعة عشرة </h5>
                                        <p>يوزع العائد السنوي للاستثمار والمرابحة المشار إليه في المادة الثالثة عشرة على جميع الأعضاء في
                                            نهاية كل سنة مالية للصندوق. </p>
                                        <h5>المادة العشرون</h5>
                                        <p>
                                            ينتهي اشتراك المشترك في الصندوق في أي من الحالتين الآتيتين:
                                            <br>
                                            1. في حال رغبته في إنهاء اشتراكه على أن يقدم طلباً موقعاً منه باسم رئيس المجلس.
                                            <br>
                                            2. انتهاء خدمة المشترك بالندوة.
                                        </p>
                                        <h5>المادة الحادية والعشرون</h5>
                                        <p>
                                            يسترد المشترك الذي ينتهي اشتراكه في الصندوق (أو ورثته في حال وفاته) مجموع المبالغ التي دفعها
                                            للصندوق إضافة إلى حصته من موارد الصندوق، مع مراعاة ما يأتي:
                                            <br>
                                            1. تحسب حقوق المشترك في ضوء المركز المالي للصندوق بحيث يستفيد من المكسب الذي تحقق ويتحمل تبعة
                                            الخسارة حسب القاعدة المعروفة (الغنم بالغرم).
                                            <br>
                                            2. إذا كان انتهاء الاشتراك يرجع إلى ترك الخدمة في الندوة، فإنَّ ردَّ المبالغ المشار إليها يكون
                                            بعد سداد مديونية المشترك للصندوق كاملة.
                                            <br>
                                            3. إذا كان انتهاء الاشتراك يرجع إلى انسحاب المشترك من الصندوق فإنَّ ردَّ المبالغ المشار إليها
                                            يكون بعد سداد مديونية المشترك للصندوق كاملة، فإذا كانت مستحقاته لدى الصندوق غير كافية فإنه يلزم
                                            بدفعها نقدا أو تخصم من أجره الشهري المستحق لدى الندوة.
                                            <br>
                                            4. يسترد المشترك رصيد اشتراكاته الشهرية في الصندوق أو بعضها وفقاً لما هو وارد في الفقرات (3،2،1)
                                            من هذه المادة خلال شهر ين من تاريخ تقديم الطلب أو انتهاء الخدمة. ويؤجل صرف ما يخصه من أرباح أو
                                            ما يتحمله من خسائر لا قدر الله إلى نهاية السنة المالية بعد صدور الميزانية السنوية للصندوق.

                                        </p>
                                        <h5>المادة الثانية والعشرون</h5>
                                        <p>تبدأ السنة المالية للصندوق ابتداء من الشهر الأول للعام الميلادي تزامناً مع السنة المالية للندوة.
                                        </p>
                                        <h5>المادة الثالثة والعشرون</h5>
                                        <p>للأمين العام للندوة العالمية للشباب الإسلامي صلاحية حل الصندوق أو مجلس إدارته، وذلك في الحالات
                                            التي يتعذر فيها على الصندوق ممارسة نشاطه.</p>
                                        <h5>المادة الرابعة والعشرون</h5>
                                        <p>يعمل بأحكام هذه اللائحة اعتباراً من تاريخ اعتمادها من لدن الأمين العام.</p>
                                    </div>
                                </div>
                                <div class="card-footer text-center">
                                    <div>
                                        {{-- <label for="">
                                            <input id="slatebox" type="checkbox" onchange="showlink()">
                                            <strong>أقر بأني اطلعت على لائحة صندوق الادخار وتفهمت جميع بنودها وقبلت التعامل بموجبها في جميع معاملاتي ومستحقاتي حالياً ومستقبلاً.</strong>
                                        </label>
                                        @if ($result == 1)
                                            <a id="slatelink" href="#" class="btn btn-primary hidden">لديك طلب سابق</a>
                                        @else

                                        @endif --}}
                                        <a id="slatelink" href="{{ route('savings.create') }}" class="btn btn-primary">أوافق</a>
                                    </div>
                                    <div>
                                        <br><br>
                                        <a href="{{ route('getDownload', 'slate.pdf') }}" class="btn btn-primary">تحميل الملف كنسخة pdf</a>
                                        <a href="{{ route('getfile', 'slate.pdf') }}" class="btn btn-primary">عرض الملف</a>
                                    </div>
                                </div>
                            </div>
                            {{-- <div style="margin-bottom: 180px"></div> --}}
                        </div>
                    </div>

                </div>
            </div>
        </div>
    </div>

@endsection
@section('js')
<script>
    var date = $('.fc-datepicker').datepicker({
        dateFormat: 'yy-mm-dd'
    }).val();

    /* function validateForm() {
        var premium = document.getElementById('newpremium').value,
            sal = document.getElementById('salary').value,
            amount = sal * 0.5;
        amount2 = sal * 0.05;

        if (premium <= amount2) {
            alert("يجب ان يكون المبلغ أكبر من 5% من إجمالي الراتب");

            return false;
        }
        if (premium > amount) {
            alert("يجب ان يكون المبلغ أصغر من 50% من إجمالي الراتب");
            return false;
        }
    }

    function ratepremium() {
        var rate = document.getElementById('ratenewpremium').value,
            sal = document.getElementById('salary').value;
        if (rate != 0) {
            var newval = rate / 100,
                newpremium = sal * newval;
            document.getElementById('newpremium').value = newpremium;
        } else {
            document.getElementById('newpremium').value = 0;
        }


    } */

    function nextlink(){
        var slatemsg = document.getElementById('slatemsg'),
        slateboard = document.getElementById('slateboard');
        slatemsg.style.display = "none";
        slateboard.style.display = "block";
    }

</script>
@endsection



